<p style="text-align:center">
    <a href="https://skills.network/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDA0321ENSkillsNetwork21426264-2022-01-01" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo"  />
    </a>
</p>

# **Collecting Job Data Using APIs**

Estimated time needed: **45 to 60** minutes

## Objectives

After completing this lab, you will be able to:

*   Collect job data from Jobs API
*   Store the collected data into an excel spreadsheet.

> <strong>Note: Before starting with the assignment make sure to read all the instructions and then move ahead with the coding part.</strong>

#### Instructions

To run the actual lab, firstly you need to click on the [Jobs_API](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DA0321EN-SkillsNetwork/labs/module%201/Accessing%20Data%20Using%20APIs/Jobs_API.ipynb) notebook link. The file contains flask code which is required to run the Jobs API data.

Now, to run the code in the file that opens up follow the below steps.

Step1: Download the file.

Step2: Upload it on the IBM Watson studio. (If IBM Watson Cloud service does not work in your system, follow the alternate Step 2 below)

Step2(alternate): Upload it in your SN labs environment using the upload button which is highlighted in red in the image below:
Remember to upload this Jobs_API file in the same folder as your current .ipynb file

<img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DA0321EN-SkillsNetwork/labs/module%201/Accessing%20Data%20Using%20APIs/Upload.PNG" />

Step3:  Run all the cells of the Jobs_API file. (Even if you receive an asterik sign after running the last cell, the code works fine.)

If you want to learn more about flask, which is optional, you can click on this link [here](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DA0321EN-SkillsNetwork/labs/module%201/Accessing%20Data%20Using%20APIs/FLASK_API.md.html).

Once you run the flask code, you can start with your assignment.

## Dataset Used in this Assignment

The dataset used in this lab comes from the following source: [https://www.kaggle.com/promptcloud/jobs-on-naukricom](https://www.kaggle.com/promptcloud/jobs-on-naukricom?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDA0321ENSkillsNetwork21426264-2022-01-01) under the under a **Public Domain license**.

> Note: We are using a modified subset of that dataset for the lab, so to follow the lab instructions successfully please use the dataset provided with the lab, rather than the dataset from the original source.

The original dataset is a csv. We have converted the csv to json as per the requirement of the lab.

## Warm-Up Exercise

Before you attempt the actual lab, here is a fully solved warmup exercise that will help you to learn how to access an API.

Using an API, let us find out who currently are on the International Space Station (ISS).<br> The API at [http://api.open-notify.org/astros.json](http://api.open-notify.org/astros.json?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDA0321ENSkillsNetwork21426264-2021-01-01&cm_mmc=Email_Newsletter-\_-Developer_Ed%2BTech-\_-WW_WW-\_-SkillsNetwork-Courses-IBM-DA0321EN-SkillsNetwork-21426264&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ) gives us the information of astronauts currently on ISS in json format.<br>
You can read more about this API at [http://open-notify.org/Open-Notify-API/People-In-Space/](http://open-notify.org/Open-Notify-API/People-In-Space?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDA0321ENSkillsNetwork21426264-2021-01-01&cm_mmc=Email_Newsletter-\_-Developer_Ed%2BTech-\_-WW_WW-\_-SkillsNetwork-Courses-IBM-DA0321EN-SkillsNetwork-21426264&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ)

In [36]:
import requests # you need this module to make an API call
import pandas as pd

In [37]:
api_url = "http://api.open-notify.org/astros.json" # this url gives use the astronaut data

In [68]:
payload = {}
response = requests.get(api_url) # Call the API using the get method and store the
                                # output of the API call in a variable called response.

In [69]:
response.ok

True

In [70]:
if response.ok:             # if all is well() no errors, no network timeouts)
    data = response.json()  # store the result in json format in a variable called data
                            # the variable data is of type dictionary.

In [71]:
print(data)   # print the data just to check the output or for debugging

{'number': 10, 'people': [{'name': 'Oleg Artemyev', 'craft': 'ISS'}, {'name': 'Denis Matveev', 'craft': 'ISS'}, {'name': 'Sergey Korsakov', 'craft': 'ISS'}, {'name': 'Kjell Lindgren', 'craft': 'ISS'}, {'name': 'Bob Hines', 'craft': 'ISS'}, {'name': 'Samantha Cristoforetti', 'craft': 'ISS'}, {'name': 'Jessica Watkins', 'craft': 'ISS'}, {'name': 'Cai Xuzhe', 'craft': 'Tiangong'}, {'name': 'Chen Dong', 'craft': 'Tiangong'}, {'name': 'Liu Yang', 'craft': 'Tiangong'}], 'message': 'success'}

In [72]:
len(data)

3

In [8]:
# My way
df_data=pd.DataFrame(data)
df_data

   number                                             people  message
0      10          {'name': 'Oleg Artemyev', 'craft': 'ISS'}  success
1      10          {'name': 'Denis Matveev', 'craft': 'ISS'}  success
2      10        {'name': 'Sergey Korsakov', 'craft': 'ISS'}  success
3      10         {'name': 'Kjell Lindgren', 'craft': 'ISS'}  success
4      10              {'name': 'Bob Hines', 'craft': 'ISS'}  success
5      10  {'name': 'Samantha Cristoforetti', 'craft': 'I...  success
6      10        {'name': 'Jessica Watkins', 'craft': 'ISS'}  success
7      10         {'name': 'Cai Xuzhe', 'craft': 'Tiangong'}  success
8      10         {'name': 'Chen Dong', 'craft': 'Tiangong'}  success
9      10          {'name': 'Liu Yang', 'craft': 'Tiangong'}  success

Print the number of astronauts currently on ISS.

In [9]:
print(data.get('number'))

10

Print the names of the astronauts currently on ISS.

In [13]:
astronauts = data.get('people')
#print("There are {} astronauts on ISS".format(len(astronauts)))
print(f'There are {len(astronauts)} astronauts on ISS')
print("And their names are :")
for astronaut in astronauts:
    print(astronaut.get('name'))

There are 10 astronauts on ISS
And their names are :
Oleg Artemyev
Denis Matveev
Sergey Korsakov
Kjell Lindgren
Bob Hines
Samantha Cristoforetti
Jessica Watkins
Cai Xuzhe
Chen Dong
Liu Yang

In [21]:
data.get('people')

[{'name': 'Oleg Artemyev', 'craft': 'ISS'},
 {'name': 'Denis Matveev', 'craft': 'ISS'},
 {'name': 'Sergey Korsakov', 'craft': 'ISS'},
 {'name': 'Kjell Lindgren', 'craft': 'ISS'},
 {'name': 'Bob Hines', 'craft': 'ISS'},
 {'name': 'Samantha Cristoforetti', 'craft': 'ISS'},
 {'name': 'Jessica Watkins', 'craft': 'ISS'},
 {'name': 'Cai Xuzhe', 'craft': 'Tiangong'},
 {'name': 'Chen Dong', 'craft': 'Tiangong'},
 {'name': 'Liu Yang', 'craft': 'Tiangong'}]

In [24]:
# Use the get() method to access the key of a dictionary
for people in data.get('people'):
    print(people.get('name'))

Oleg Artemyev
Denis Matveev
Sergey Korsakov
Kjell Lindgren
Bob Hines
Samantha Cristoforetti
Jessica Watkins
Cai Xuzhe
Chen Dong
Liu Yang

In [20]:
# The normal way to access the key of a dictionary
print(data['number'])
for people in data['people']:
    print(people['name'])

10
Oleg Artemyev
Denis Matveev
Sergey Korsakov
Kjell Lindgren
Bob Hines
Samantha Cristoforetti
Jessica Watkins
Cai Xuzhe
Chen Dong
Liu Yang

Hope the warmup was helpful. Good luck with your next lab!

## Lab: Collect Jobs Data using Jobs API

### Objective: Determine the number of jobs currently open for various technologies  and for various locations

Collect the number of job postings for the following locations using the API:

*   Los Angeles
*   New York
*   San Francisco
*   Washington DC
*   Seattle
*   Austin
*   Detroit

In [1]:
#Import required libraries
import pandas as pd
import json

#### Write a function to get the number of jobs for the Python technology.<br>

> Note: While using the lab you need to pass the **payload** information for the **params** attribute in the form of **key** **value** pairs.

Refer the ungraded **rest api lab** in the course **Python for Data Science, AI & Development**  <a href="https://www.coursera.org/learn/python-for-applied-data-science-ai/ungradedLti/P6sW8/hands-on-lab-access-rest-apis-request-http?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDA0321ENSkillsNetwork21426264-2022-01-01">link</a>

##### The keys in the json are

*   Job Title

*   Job Experience Required

*   Key Skills

*   Role Category

*   Location

*   Functional Area

*   Industry

*   Role

You can also view  the json file contents  from the following <a href = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DA0321EN-SkillsNetwork/labs/module%201/Accessing%20Data%20Using%20APIs/jobs.json?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDA0321ENSkillsNetwork21426264-2022-01-01">json</a> URL.

In [73]:
import requests
api_url="http://127.0.0.1:5000/data"
payload = {'Key Skills': 'Python'}
response = requests.get(api_url, params=payload)

In [17]:
test_data = response.json()
print(test_data)

IOPub data rate exceeded.
The Jupyter server will temporarily stop sending output
to the client in order to avoid crashing it.
To change this limit, set the config variable
`--ServerApp.iopub_data_rate_limit`.

Current values:
ServerApp.iopub_data_rate_limit=1000000.0 (bytes/sec)
ServerApp.rate_limit_window=3.0 (secs)

In [74]:
df_selected_data = pd.DataFrame(response.json())

In [77]:
df_selected_data.shape[0]

1173

In [122]:
def get_number_of_jobs_T(technology):
    api_url = "http://127.0.0.1:5000/data"
    payload = {'Key Skills': technology}
    response = requests.get(api_url, params=payload)
    df_selected_data = pd.DataFrame(response.json())
    #number_of_jobs = len(selected_data)
    number_of_jobs = df_selected_data.shape[0]
       
    return technology, number_of_jobs

Calling the function for Python and checking if it works.

In [123]:
get_number_of_jobs_T("Python")

('Python', 1173)

#### Write a function to find number of jobs in US for a location of your choice

In [81]:
def get_number_of_jobs_L(location):
    api_url = "http://127.0.0.1:5000/data"
    payload = {'Location': location}
    response = requests.get(api_url, params=payload)
    df_selected_data = pd.DataFrame(response.json())
    
    number_of_jobs = df_selected_data.shape[0]
    
    return location, number_of_jobs

Call the function for Los Angeles and check if it is working.

In [82]:
get_number_of_jobs_L('Los Angeles')

('Los Angeles', 640)

In [143]:
def get_number_of_jobs_TL(technology, location):
    api_url = "http://127.0.0.1:5000/data"
    payload = {'Key Skills': technology, 'Location': location}
    response = requests.get(api_url, params=payload)
    df_selected_data = pd.DataFrame(response.json())
    
    number_of_jobs = df_selected_data.shape[0]
    
    #url = response.url
    #encoding = response.encoding
    
    return technology, location, number_of_jobs #, encoding #, url

In [144]:
get_number_of_jobs_TL('Python', 'Los Angeles')

('Python', 'Los Angeles', 24)

### Store the results in an excel file

Call the API for all the given technologies above and write the results in an excel spreadsheet.

If you do not know how create excel file using python, double click here for **hints**.

<!--

from openpyxl import Workbook        # import Workbook class from module openpyxl
wb=Workbook()                        # create a workbook object
ws=wb.active                         # use the active worksheet
ws.append(['Country','Continent'])   # add a row with two columns 'Country' and 'Continent'
ws.append(['Eygpt','Africa'])        # add a row with two columns 'Egypt' and 'Africa'
ws.append(['India','Asia'])          # add another row
ws.append(['France','Europe'])       # add another row
wb.save("countries.xlsx")            # save the workbook into a file called countries.xlsx


-->

Create a python list of all locations for which you need to find the number of jobs postings.

In [84]:
locations = ['Los Angeles', 'New York', 'San Francisco', 'Washington DC', 'Seattle', 'Austin', 'Detroit']

Import libraries required to create excel spreadsheet

In [83]:
from openpyxl import Workbook

Create a workbook and select the active worksheet

In [85]:
wb = Workbook()
ws = wb.active

Find the number of jobs postings for each of the location in the above list.
Write the Location name and the number of jobs postings into the excel spreadsheet.

In [98]:
ws.append(['Technologies', 'Locations', 'Number of Job Postings'])
for location in locations:
    technology_name, location_name, number_of_jobs = get_number_of_jobs_TL('C', location)
    ws.append([technology_name, location_name, number_of_jobs])

Save into an excel spreadsheet named 'job-postings.xlsx'.

In [104]:
wb.save('job-postings.xlsx')

#### In the similar way, you can try for below given technologies and results  can be stored in an excel sheet.

Collect the number of job postings for the following languages using the API:

*   C
*   C#
*   C++
*   Java
*   JavaScript
*   Python
*   Scala
*   Oracle
*   SQL Server
*   MySQL Server
*   PostgreSQL
*   MongoDB

In [105]:
from openpyxl import Workbook # import Workbook class from module openpyxl
wb = Workbook() # create a workbook object
ws = wb.active  # use the active worksheet

In [106]:
ws.append(['Technologies', 'Locations', 'Number of Job Postings']) # add a row with three columns as the headers
technologies = ['C', 'C#','C++', 'Java', 'JavaScript', 'Python', 'Scala', 'Oracle', 'SQL Server', 'MySQL Server', 'PostgreSQL', 'MongoDB']
locations = ['Los Angeles', 'New York', 'San Francisco', 'Washington DC', 'Seattle', 'Austin', 'Detroit']
for technology in technologies: # Loop through each technology
    for location in locations:  # Loop through each location
        technology_name, location_name, number_of_jobs = get_number_of_jobs_TL(technology, location) # Call the API to get the data
        ws.append([technology_name, location_name, number_of_jobs]) # Write the result to an excel spreadsheet
        
wb.save('job-postings.xlsx') # Save the excel spreadsheet

In [107]:
df_jp = pd.read_excel('job-postings.xlsx')
df_jp

   Technologies      Locations  Number of Job Postings
0             C    Los Angeles                     296
1             C       New York                    1622
2             C  San Francisco                     214
3             C  Washington DC                    2664
4             C        Seattle                    1668
..          ...            ...                     ...
79      MongoDB  San Francisco                       2
80      MongoDB  Washington DC                      32
81      MongoDB        Seattle                      21
82      MongoDB         Austin                       1
83      MongoDB        Detroit                      25

[84 rows x 3 columns]

In [112]:
# dataframe.pivot(index=, columns=)
df_jp_pivot = df_jp.pivot(index='Locations', columns='Technologies')
df_jp_pivot

              Number of Job Postings                                  \
Technologies                       C  C# C++ Java JavaScript MongoDB
Locations
Austin                           224   5   4   32          5       1
Detroit                         1973  60  32  353         41      25
Los Angeles                      296   5   3   43          7       2
New York                        1622  41  43  326         51      25
San Francisco                    214   3   3   38          7       2
Seattle                         1668  49  41  354         52      21
Washington DC                   2664  68  55  516         61      32


Technologies  MySQL Server Oracle PostgreSQL Python SQL Server Scala
Locations
Austin                   0     11          0     15          5     1
Detroit                  0    115          2    170         34     5
Los Angeles              0     17          0     24          3     0
New York                 0     95          1    143         36     8
San Francisco            0     19          0     17          2     0
Seattle                  0    110          1    133         31     4
Washington DC            0    143          3    258         53     3

In [126]:
pd.set_option('display.max_rows', None)
# dataframe.groupby()
df_jp_grouped = df_jp.groupby(['Locations', 'Technologies'], as_index=True).sum()
df_jp_grouped

                            Number of Job Postings
Locations     Technologies
Austin        C                                224
              C#                                 5
              C++                                4
              Java                              32
              JavaScript                         5
              MongoDB                            1
              MySQL Server                       0
              Oracle                            11
              PostgreSQL                         0
              Python                            15
              SQL Server                         5
              Scala                              1
Detroit       C                               1973
              C#                                60
              C++                               32
              Java                             353
              JavaScript                        41
              MongoDB                           25
              MySQL Server                       0
              Oracle                           115
              PostgreSQL                         2
              Python                           170
              SQL Server                        34
              Scala                              5
Los Angeles   C                                296
              C#                                 5
              C++                                3
              Java                              43
              JavaScript                         7
              MongoDB                            2
              MySQL Server                       0
              Oracle                            17
              PostgreSQL                         0
              Python                            24
              SQL Server                         3
              Scala                              0
New York      C                               1622
              C#                                41
              C++                               43
              Java                             326
              JavaScript                        51
              MongoDB                           25
              MySQL Server                       0
              Oracle                            95
              PostgreSQL                         1
              Python                           143
              SQL Server                        36
              Scala                              8
San Francisco C                                214
              C#                                 3
              C++                                3
              Java                              38
              JavaScript                         7
              MongoDB                            2
              MySQL Server                       0
              Oracle                            19
              PostgreSQL                         0
              Python                            17
              SQL Server                         2
              Scala                              0
Seattle       C                               1668
              C#                                49
              C++                               41
              Java                             354
              JavaScript                        52
              MongoDB                           21
              MySQL Server                       0
              Oracle                           110
              PostgreSQL                         1
              Python                           133
              SQL Server                        31
              Scala                              4
Washington DC C                               2664
              C#                                68
              C++                               55
              Java                             516
              JavaScript                        61
              MongoDB                           32
              MySQL Server                       0
              Oracle                           143
              PostgreSQL                         3
              Python                           258
              SQL Server                        53
              Scala                              3

In [124]:
df_jp_selectedL = df_jp[df_jp['Locations'] in ["Los Angeles", "New York", "San Francisco", "Washington DC", "Seattle"]]
df_jp_selectedL

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [142]:
# dataframe.groupby()
df_jp_grouped = df_jp.groupby(['Locations'], as_index=True).sum()

df_jp_grouped.sort_values(by=['Number of Job Postings'], ascending=True, axis=1)

KeyError: 'Number of Job Postings'

In [139]:
df_jp_grouped['Number of Job Postings'].sort_values(ascending=False)

Locations
Washington DC    3856
Detroit          2810
Seattle          2464
New York         2391
Los Angeles       400
San Francisco     305
Austin            303
Name: Number of Job Postings, dtype: int64

## Author

Ayushi Jain

### Other Contributors

Rav Ahuja

Lakshmi Holla

Malika

## Change Log

| Date (YYYY-MM-DD) | Version | Changed By        | Change Description                 |
| ----------------- | ------- | ----------------- | ---------------------------------- |
| 2022-01-19        | 0.3     | Lakshmi Holla     | Added changes in the markdown      |
| 2021-06-25        | 0.2     | Malika            | Updated GitHub job json link       |
| 2020-10-17        | 0.1     | Ramesh Sannareddy | Created initial version of the lab |

Copyright Â© 2022 IBM Corporation. All rights reserved.